// напиши функцію яка сумуватиме сусідні числа і пушити в новий масив
// const someArr = [22, 11, 34, 5, 12, 13, 14, 15];



/* ========================================================================================================================================================
const fruits = [
    { name: "apple", price: 200 },
    { name: "orange", price: 300 },
    { name: "grapes", price: 750 },
];
//Напиши функцію яка призначає знижку 20% на фрукти в масиві,
//Присвоїти ID для кожного продукту
Каширин Александр
15:01
function getRandomEightDigitNumber() {
    return Math.floor(10000000 + Math.random() * 90000000);
}
======================================================================================================================================================== */

/* ========================================================================================================================================================
Угруповання об'єктів студентів по курсам
Створіть масив об'єктів, що являють собою різних студентів. Кожен об'єкт повинен містити властивості ім'я, вік та курс.
Використовуйте цикл for...of, щоб згрупувати студентів за курсами.
Результатом буде об'єкт, де ключами будуть назви курсів, а значення – масиви об'єктів студентів, що належать до відповідного курсу.
Очікуванний результат:
const groupedStudents = {
Java: [
    { name: "Алиса", age: 20, course: "Java" },
    { name: "Карл", age: 21, course: "Java" },
],
Python: [{ name: "Боб", age: 22, course: "Python" }],
JavaScript: [{ name: "Джон", age: 23, course: "JavaScript" }],
};
const students = [
    { name: "Алиса", age: 20, course: "Java" },
    { name: "Боб", age: 22, course: "Python" },
    { name: "Карл", age: 21, course: "Java" },
    { name: "Джон", age: 23, course: "JavaScript" },
];
======================================================================================================================================================== */


/* ========================================================================================================================================================
//TODO:=======================
//Напиши скрипт, який для об'єкта user,
//Послідовно:
//1 додати поле mood зі значенням 'happy'
//2 замінити hobby на 'skydiving'
//3 замінити значення premium на false
//4 виводити вміст об'єкта user у форматі

//ключ:значення використовуючи Object.keys() і for...of
// const user = {
// name: "John",
// age: 20,
// hobby: "tenis",
// premium: true,
//};
// Додати метод getinfo в об'єкт user, який повертатиме інфу про користувача у форматі
// Name: Peter. Surname: Parker. Age: 22. Position: spider-man.

// const user = {
//     name: 'Peter',
//     surname: 'Parker',
//     age: 22,
//     position: 'spider-man'
// }

// const user2 = {
//   name: "Batman",
//   surname: "Hz",
//   age: 36,
//   position: "batman",
// };
======================================================================================================================================================== */

/* ========================================================================================================================================================
//Напишіть функцію updateObject, яка приймає об'єкт та повертає
//новий об'єкт без зазначеного параметра
//Очікуваний результат ({a: 1. b: 2}, 'b') => {a: 1}
======================================================================================================================================================== */


